examples/httpreq/corpus/8

POST /enlighten/calais.asmx HTTP/1.1
Host: api.opencalais.com
Content-Type: text/xml; charset=utf-8
Content-Length: 500
SOAPAction: "http://clearforest.com/Enlighten"

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
  <Enlighten xmlns="http://clearforest.com/">
  <licenseID>string </licenseID>
  <content>string</content>
  <paramsXML>string </paramsXML>
  </Enlighten>
  </soap:Body>
</soap:Envelope>

